wrk_test_results.txt
=== MLOps Scaling WRK Test Results ===
Date: Wed Jul 30 01:08:52 IST 2025
External IP: 34.30.76.55

=== Test 1: Light Load (50 users, 30s) ===
Running 30s test @ http://34.30.76.55/predict
  4 threads and 50 connections
Completed 100 requests
Completed 100 requests
Completed 100 requests
[...]
Completed 200 requests
Completed 200 requests
Completed 200 requests
[...]
Completed 300 requests
Completed 300 requests
Completed 300 requests
[...]
Completed 400 requests
Completed 400 requests
Completed 400 requests
[...]
Completed 500 requests
Completed 500 requests
Completed 500 requests
Completed 600 requests
Completed 500 requests
Completed 600 requests
Completed 600 requests
Completed 700 requests
Completed 600 requests
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   512.99ms  213.02ms   1.44s    72.15%
    Req/Sec    23.92     13.33    80.00     53.34%
  2772 requests in 30.05s, 652.39KB read
Requests/sec:     92.26
Transfer/sec:     21.71KB
Total requests: 2772
Total errors: 0
Average latency: 512985.55882353ms
Max latency: 1435982ms
Requests/sec: 92.259061981615

=== Test 2: Medium Load (150 users, 60s) ===
Running 1m test @ http://34.30.76.55/predict
  6 threads and 150 connections
Completed 100 requests
Completed 100 requests
Completed 100 requests
[...]
Completed 200 requests
Completed 200 requests
Completed 200 requests
[...]
Completed 300 requests
Completed 300 requests
Completed 300 requests
[...]
Completed 400 requests
Completed 400 requests
Completed 400 requests
[...]
Completed 500 requests
Completed 500 requests
Completed 500 requests
[...]
Completed 600 requests
Completed 600 requests
Completed 600 requests
[...]
Completed 700 requests
Completed 700 requests
Completed 700 requests
[...]
Completed 800 requests
Completed 800 requests
Completed 800 requests
[...]
Completed 900 requests
Completed 900 requests
Completed 900 requests
[...]
Completed 1000 requests
Completed 900 requests
Completed 1000 requests
Completed 1000 requests
Completed 1000 requests
Completed 1100 requests
Completed 1000 requests
Completed 1100 requests
Completed 1000 requests
Completed 1100 requests
Completed 1100 requests
Completed 1200 requests
Completed 1200 requests
Completed 1100 requests
Completed 1100 requests
Completed 1200 requests
Completed 1200 requests
Completed 1300 requests
Completed 1300 requests
Completed 1200 requests
Completed 1200 requests
Completed 1300 requests
Completed 1400 requests
Completed 1400 requests
Completed 1300 requests
Completed 1300 requests
Completed 1300 requests
Completed 1400 requests
Completed 1500 requests
Completed 1500 requests
Completed 1400 requests
Completed 1400 requests
Completed 1400 requests
Completed 1600 requests
Completed 1500 requests
Completed 1600 requests
Completed 1500 requests
Completed 1500 requests
Completed 1500 requests
Completed 1700 requests
Completed 1700 requests
Completed 1600 requests
Completed 1600 requests
Completed 1600 requests
[...]
Completed 1800 requests
Completed 1700 requests
Completed 1800 requests
Completed 1700 requests
Completed 1700 requests
Completed 1700 requests
Completed 1900 requests
Completed 1900 requests
Completed 1800 requests
Completed 1800 requests
Completed 1800 requests
[...]
Completed 2000 requests
Completed 2000 requests
Completed 1900 requests
Completed 1900 requests
Completed 1900 requests
[...]
Completed 2100 requests
Completed 2100 requests
Completed 2000 requests
Completed 2000 requests
Completed 2000 requests
[...]
Completed 2200 requests
Completed 2200 requests
Completed 2100 requests
Completed 2100 requests
Completed 2100 requests
[...]
Completed 2300 requests
Completed 2300 requests
Completed 2200 requests
Completed 2200 requests
Completed 2200 requests
[...]
Completed 2400 requests
Completed 2400 requests
Completed 2300 requests
Completed 2300 requests
Completed 2300 requests
Completed 2500 requests
Completed 2300 requests
Completed 2500 requests
Completed 2400 requests
Completed 2400 requests
Completed 2400 requests
Completed 2600 requests
Completed 2400 requests
Completed 2600 requests
Completed 2500 requests
Completed 2500 requests
Completed 2500 requests
Completed 2700 requests
Completed 2500 requests
Completed 2700 requests
Completed 2600 requests
Completed 2600 requests
Completed 2600 requests
Completed 2800 requests
Completed 2800 requests
Completed 2600 requests
Completed 2700 requests
Completed 2700 requests
Completed 2700 requests
Completed 2900 requests
Completed 2900 requests
Completed 2700 requests
Completed 2800 requests
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   539.51ms  299.40ms   1.99s    83.50%
    Req/Sec    49.13     30.10   158.00     64.65%
  16968 requests in 1.00m, 3.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:    282.57
Transfer/sec:     66.50KB
Total requests: 16968
Total errors: 0
Average latency: 539505.48960148ms
Max latency: 1994189ms
Requests/sec: 282.56512245138

=== Test 3: High Load (300 users, 90s) ===
Running 2m test @ http://34.30.76.55/predict
  8 threads and 300 connections
Completed 100 requests
Completed 100 requests
Completed 100 requests
[...]
Completed 200 requests
Completed 200 requests
Completed 200 requests
[...]
Completed 300 requests
Completed 300 requests
Completed 300 requests
[...]
Completed 400 requests
Completed 400 requests
Completed 400 requests
[...]
Completed 500 requests
Completed 500 requests
Completed 500 requests
[...]
Completed 600 requests
Completed 600 requests
Completed 600 requests
[...]
Completed 700 requests
Completed 700 requests
Completed 700 requests
[...]
Completed 800 requests
Completed 700 requests
Completed 800 requests
Completed 800 requests
Completed 800 requests
[...]
Completed 900 requests
Completed 800 requests
Completed 900 requests
Completed 900 requests
Completed 900 requests
[...]
Completed 1000 requests
Completed 900 requests
Completed 900 requests
Completed 900 requests
Completed 1000 requests
Completed 1000 requests
Completed 1000 requests
[...]
Completed 1100 requests
Completed 1000 requests
Completed 1000 requests
Completed 1100 requests
Completed 1100 requests
Completed 1000 requests
Completed 1100 requests
Completed 1100 requests
Completed 1200 requests
Completed 1100 requests
Completed 1100 requests
Completed 1200 requests
Completed 1200 requests
Completed 1100 requests
Completed 1200 requests
Completed 1200 requests
Completed 1300 requests
Completed 1200 requests
Completed 1200 requests
Completed 1300 requests
Completed 1300 requests
Completed 1300 requests
Completed 1200 requests
Completed 1300 requests
Completed 1400 requests
Completed 1300 requests
Completed 1400 requests
Completed 1400 requests
Completed 1300 requests
Completed 1400 requests
Completed 1400 requests
Completed 1300 requests
Completed 1500 requests
Completed 1500 requests
Completed 1400 requests
Completed 1500 requests
Completed 1400 requests
Completed 1500 requests
Completed 1500 requests
Completed 1600 requests
Completed 1400 requests
Completed 1600 requests
Completed 1600 requests
Completed 1500 requests
Completed 1500 requests
Completed 1600 requests
Completed 1700 requests
Completed 1600 requests
Completed 1700 requests
Completed 1700 requests
Completed 1500 requests
Completed 1600 requests
Completed 1700 requests
Completed 1600 requests
Completed 1800 requests
Completed 1800 requests
Completed 1700 requests
Completed 1800 requests
Completed 1700 requests
Completed 1900 requests
Completed 1800 requests
Completed 1700 requests
Completed 1600 requests
Completed 1900 requests
Completed 1800 requests
Completed 1900 requests
Completed 2000 requests
Completed 1900 requests
Completed 1800 requests
Completed 1800 requests
Completed 2000 requests
Completed 1700 requests
Completed 2000 requests
Completed 1900 requests
Completed 2100 requests
Completed 2100 requests
Completed 2000 requests
Completed 1900 requests
Completed 1900 requests
Completed 2100 requests
Completed 1800 requests
Completed 2200 requests
Completed 2000 requests
Completed 2200 requests
Completed 2100 requests
Completed 2000 requests
Completed 2000 requests
Completed 2200 requests
Completed 2300 requests
Completed 1900 requests
Completed 2300 requests
Completed 2100 requests
Completed 2200 requests
Completed 2100 requests
Completed 2100 requests
Completed 2300 requests
Completed 2400 requests
Completed 2400 requests
Completed 2200 requests
Completed 2000 requests
Completed 2300 requests
Completed 2200 requests
Completed 2200 requests
Completed 2400 requests
Completed 2500 requests
Completed 2500 requests
Completed 2300 requests
Completed 2400 requests
Completed 2100 requests
Completed 2300 requests
Completed 2500 requests
Completed 2300 requests
Completed 2600 requests
Completed 2600 requests
Completed 2500 requests
Completed 2400 requests
Completed 2600 requests
Completed 2700 requests
Completed 2400 requests
Completed 2400 requests
Completed 2200 requests
Completed 2700 requests
Completed 2600 requests
Completed 2800 requests
Completed 2700 requests
Completed 2500 requests
Completed 2800 requests
Completed 2500 requests
Completed 2500 requests
Completed 2300 requests
Completed 2900 requests
Completed 2700 requests
Completed 2800 requests
Completed 2900 requests
Completed 2600 requests
Completed 2600 requests
Completed 2600 requests
Completed 2400 requests
Completed 3000 requests
Completed 2800 requests
Completed 2900 requests
Completed 3000 requests
Completed 2700 requests
Completed 2700 requests
Completed 2700 requests
Completed 3100 requests
Completed 3000 requests
Completed 3100 requests
Completed 2900 requests
Completed 2500 requests
Completed 2800 requests
Completed 2800 requests
Completed 2800 requests
Completed 3200 requests
Completed 3200 requests
Completed 3100 requests
Completed 3000 requests
Completed 2600 requests
Completed 2900 requests
Completed 2900 requests
Completed 2900 requests
Completed 3300 requests
Completed 3300 requests
Completed 3200 requests
Completed 3100 requests
Completed 2700 requests
Completed 3400 requests
Completed 3000 requests
Completed 3000 requests
Completed 3000 requests
Completed 3300 requests
Completed 3400 requests
Completed 3200 requests
Completed 3500 requests
Completed 3100 requests
Completed 3100 requests
Completed 3500 requests
Completed 3400 requests
Completed 2800 requests
Completed 3100 requests
Completed 3300 requests
Completed 3600 requests
Completed 3600 requests
Completed 3500 requests
Completed 3200 requests
Completed 3200 requests
Completed 3200 requests
Completed 3400 requests
Completed 2900 requests
Completed 3700 requests
Completed 3700 requests
Completed 3600 requests
Completed 3300 requests
Completed 3300 requests
Completed 3300 requests
Completed 3500 requests
Completed 3000 requests
Completed 3800 requests
Completed 3700 requests
Completed 3800 requests
Completed 3400 requests
Completed 3400 requests
Completed 3600 requests
Completed 3400 requests
Completed 3900 requests
Completed 3100 requests
Completed 3800 requests
Completed 3900 requests
Completed 3700 requests
Completed 3500 requests
Completed 3500 requests
Completed 4000 requests
Completed 3500 requests
Completed 3900 requests
Completed 4000 requests
Completed 3200 requests
Completed 3800 requests
Completed 4100 requests
Completed 3600 requests
Completed 3600 requests
Completed 3600 requests
Completed 4100 requests
Completed 4000 requests
Completed 3900 requests
Completed 4200 requests
Completed 3300 requests
Completed 3700 requests
Completed 3700 requests
Completed 4100 requests
Completed 4200 requests
Completed 3700 requests
Completed 4000 requests
Completed 4300 requests
Completed 3400 requests
Completed 3800 requests
Completed 3800 requests
Completed 4200 requests
Completed 4300 requests
Completed 3800 requests
Completed 4400 requests
Completed 4100 requests
Completed 4300 requests
Completed 4400 requests
Completed 3900 requests
Completed 3500 requests
Completed 3900 requests
Completed 3900 requests
Completed 4500 requests
Completed 4200 requests
Completed 4400 requests
Completed 4500 requests
Completed 4000 requests
Completed 4000 requests
Completed 4600 requests
Completed 3600 requests
Completed 4000 requests
Completed 4300 requests
Completed 4500 requests
Completed 4600 requests
Completed 4100 requests
Completed 4700 requests
Completed 4100 requests
Completed 3700 requests
Completed 4400 requests
Completed 4100 requests
Completed 4600 requests
Completed 4700 requests
Completed 4800 requests
Completed 4200 requests
Completed 4200 requests
Completed 4500 requests
Completed 4200 requests
Completed 4700 requests
Completed 4800 requests
Completed 3800 requests
Completed 4900 requests
Completed 4300 requests
Completed 4300 requests
Completed 4600 requests
Completed 4800 requests
Completed 4900 requests
Completed 4300 requests
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   688.98ms  433.37ms   2.00s    83.19%
    Req/Sec    51.95     32.79   190.00     66.71%
  36269 requests in 1.50m, 8.34MB read
  Socket errors: connect 0, read 0, write 0, timeout 1331
Requests/sec:    402.59
Transfer/sec:     94.75KB
Total requests: 36269
Total errors: 0
Average latency: 688983.10473656ms
Max latency: 1999992ms
Requests/sec: 402.59445815169

=== Test 4: Stress Test (500 users, 120s) ===
Running 2m test @ http://34.30.76.55/predict
  12 threads and 500 connections
Completed 100 requests
Completed 100 requests
Completed 100 requests
[...]
Completed 200 requests
Completed 200 requests
Completed 200 requests
[...]
Completed 300 requests
Completed 300 requests
Completed 300 requests
[...]
Completed 400 requests
Completed 300 requests
Completed 400 requests
Completed 300 requests
Completed 300 requests
Completed 400 requests
Completed 400 requests
Completed 400 requests
[...]
Completed 500 requests
Completed 500 requests
Completed 400 requests
Completed 500 requests
Completed 500 requests
Completed 400 requests
Completed 400 requests
Completed 500 requests
Completed 500 requests
Completed 500 requests
Completed 600 requests
Completed 500 requests
Completed 600 requests
Completed 500 requests
Completed 600 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 600 requests
Completed 500 requests
Completed 500 requests
Completed 600 requests
Completed 600 requests
Completed 600 requests
Completed 700 requests
Completed 700 requests
Completed 800 requests
Completed 700 requests
Completed 600 requests
Completed 600 requests
Completed 700 requests
Completed 700 requests
Completed 600 requests
Completed 600 requests
Completed 800 requests
Completed 700 requests
Completed 700 requests
Completed 900 requests
Completed 800 requests
Completed 800 requests
Completed 700 requests
Completed 800 requests
Completed 800 requests
Completed 700 requests
Completed 1000 requests
Completed 900 requests
Completed 700 requests
Completed 900 requests
Completed 800 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 900 requests
Completed 1100 requests
Completed 900 requests
Completed 800 requests
Completed 1000 requests
Completed 800 requests
Completed 1000 requests
Completed 800 requests
Completed 900 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Completed 1200 requests
Completed 1000 requests
Completed 1000 requests
Completed 900 requests
Completed 1100 requests
Completed 1100 requests
Completed 900 requests
Completed 1300 requests
Completed 900 requests
Completed 1000 requests
Completed 900 requests
Completed 1100 requests
Completed 1000 requests
Completed 1100 requests
Completed 1100 requests
Completed 1200 requests
Completed 1200 requests
Completed 1400 requests
Completed 1000 requests
Completed 1000 requests
Completed 1200 requests
Completed 1100 requests
Completed 1000 requests
Completed 1200 requests
Completed 1000 requests
Completed 1200 requests
Completed 1100 requests
Completed 1300 requests
Completed 1500 requests
Completed 1300 requests
Completed 1100 requests
Completed 1300 requests
Completed 1600 requests
Completed 1300 requests
Completed 1100 requests
Completed 1300 requests
Completed 1400 requests
Completed 1200 requests
Completed 1400 requests
Completed 1100 requests
Completed 1100 requests
Completed 1200 requests
Completed 1200 requests
Completed 1700 requests
Completed 1400 requests
Completed 1400 requests
Completed 1500 requests
Completed 1400 requests
Completed 1500 requests
Completed 1200 requests
Completed 1300 requests
Completed 1800 requests
Completed 1200 requests
Completed 1200 requests
Completed 1500 requests
Completed 1600 requests
Completed 1500 requests
Completed 1300 requests
Completed 1300 requests
Completed 1500 requests
Completed 1600 requests
Completed 1900 requests
Completed 1300 requests
Completed 1400 requests
Completed 1600 requests
Completed 1700 requests
Completed 1600 requests
Completed 1600 requests
Completed 2000 requests
Completed 1300 requests
Completed 1300 requests
Completed 1700 requests
Completed 1400 requests
Completed 1400 requests
Completed 1700 requests
Completed 1800 requests
Completed 1400 requests
Completed 2100 requests
Completed 1500 requests
Completed 1700 requests
Completed 1700 requests
Completed 1800 requests
Completed 1400 requests
Completed 2200 requests
Completed 1400 requests
Completed 1900 requests
Completed 1500 requests
Completed 1800 requests
Completed 1800 requests
Completed 1500 requests
Completed 1800 requests
Completed 1600 requests
Completed 1500 requests
Completed 1900 requests
Completed 2300 requests
Completed 2000 requests
Completed 1900 requests
Completed 1500 requests
Completed 1500 requests
Completed 1900 requests
Completed 1600 requests
Completed 1900 requests
Completed 2400 requests
Completed 1600 requests
Completed 1600 requests
Completed 2000 requests
Completed 1700 requests
Completed 2100 requests
Completed 2000 requests
Completed 2000 requests
Completed 1600 requests
Completed 1600 requests
Completed 2500 requests
Completed 2000 requests
Completed 2200 requests
Completed 1700 requests
Completed 2100 requests
Completed 1700 requests
Completed 1800 requests
Completed 1700 requests
Completed 2100 requests
Completed 2600 requests
Completed 2100 requests
Completed 2300 requests
Completed 1700 requests
Completed 2100 requests
Completed 1700 requests
Completed 2200 requests
Completed 1800 requests
Completed 2200 requests
Completed 1800 requests
Completed 1900 requests
Completed 2700 requests
Completed 1800 requests
Completed 2200 requests
Completed 2400 requests
Completed 2300 requests
Completed 2200 requests
Completed 1800 requests
Completed 2300 requests
Completed 1800 requests
Completed 2800 requests
Completed 1900 requests
Completed 1900 requests
Completed 2500 requests
Completed 2000 requests
Completed 2300 requests
Completed 1900 requests
Completed 2400 requests
Completed 2300 requests
Completed 2900 requests
Completed 2400 requests
Completed 1900 requests
Completed 1900 requests
Completed 2600 requests
Completed 2000 requests
Completed 2400 requests
Completed 2000 requests
Completed 2100 requests
Completed 3000 requests
Completed 2500 requests
Completed 2000 requests
Completed 2400 requests
Completed 2500 requests
Completed 2700 requests
Completed 2000 requests
Completed 2500 requests
Completed 2000 requests
Completed 2100 requests
Completed 3100 requests
Completed 2100 requests
Completed 2200 requests
Completed 2500 requests
Completed 2600 requests
Completed 2600 requests
Completed 2100 requests
Completed 2600 requests
Completed 2100 requests
Completed 2800 requests
Completed 3200 requests
Completed 2100 requests
Completed 2200 requests
Completed 2700 requests
Completed 2700 requests
Completed 2600 requests
Completed 2200 requests
Completed 2300 requests
Completed 3300 requests
Completed 2700 requests
Completed 2200 requests
Completed 2200 requests
Completed 2200 requests
Completed 2900 requests
Completed 2800 requests
Completed 2300 requests
Completed 2800 requests
Completed 2700 requests
Completed 2400 requests
Completed 3400 requests
Completed 2300 requests
Completed 2800 requests
Completed 2300 requests
Completed 2300 requests
Completed 2300 requests
Completed 2900 requests
Completed 2400 requests
Completed 3000 requests
Completed 2900 requests
Completed 3500 requests
Completed 2500 requests
Completed 2800 requests
Completed 2900 requests
Completed 2400 requests
Completed 2400 requests
Completed 2400 requests
Completed 3000 requests
Completed 2400 requests
Completed 2500 requests
Completed 3600 requests
Completed 3100 requests
Completed 3000 requests
Completed 2600 requests
Completed 2900 requests
Completed 3000 requests
Completed 2500 requests
Completed 3100 requests
Completed 2500 requests
Completed 2500 requests
Completed 3700 requests
Completed 2500 requests
Completed 2600 requests
Completed 3100 requests
Completed 3200 requests
Completed 2700 requests
Completed 3000 requests
Completed 3100 requests
Completed 3200 requests
Completed 3800 requests
Completed 2600 requests
Completed 2600 requests
Completed 2600 requests
[...]
Completed 2700 requests
Completed 3200 requests
Completed 2800 requests
Completed 3300 requests
Completed 3100 requests
Completed 3300 requests
Completed 3900 requests
Completed 3200 requests
Completed 2700 requests
Completed 2700 requests
Completed 2900 requests
Completed 2700 requests
Completed 3300 requests
Completed 2800 requests
Completed 2700 requests
Completed 3400 requests
Completed 3200 requests
Completed 3400 requests
Completed 4000 requests
Completed 3300 requests
Completed 2800 requests
Completed 3000 requests
Completed 2800 requests
Completed 3400 requests
Completed 2800 requests
Completed 2900 requests
Completed 2800 requests
Completed 3500 requests
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   979.38ms  524.60ms   2.00s    60.30%
    Req/Sec    29.56     22.07   170.00     81.38%
  38395 requests in 2.00m, 8.82MB read
  Socket errors: connect 0, read 599, write 3, timeout 9685
Requests/sec:    319.70
Transfer/sec:     75.24KB
Total requests: 38395
Total errors: 0
Average latency: 979384.9225357ms
Max latency: 1999998ms
Requests/sec: 319.69775568512